# DataFrames in Pandas
## DataFrames sind zweidimensionale Tabellen (ähnlich wie z.B. in Datenbanken und Excel)
## Sie sind eine Aneinanderreihung von Serien

In [1]:
data = { 'Stadt': ['Nürnberg', 'München', 'Erlangen'],
         'Einwohner':  [500000, 1000000, 100000],
         'Fluss':  ['Pegnitz','Isar', 'Rednitz'] }
data

{'Stadt': ['Nürnberg', 'München', 'Erlangen'],
 'Einwohner': [500000, 1000000, 100000],
 'Fluss': ['Pegnitz', 'Isar', 'Rednitz']}

In [2]:
import pandas as pd
from pandas import DataFrame

In [3]:
f = DataFrame(data)
f

      Stadt  Einwohner    Fluss
0  Nürnberg     500000  Pegnitz
1   München    1000000     Isar
2  Erlangen     100000  Rednitz

In [4]:
f['Weltstadt'] = ( f['Einwohner'] >= 500000 ); f

      Stadt  Einwohner    Fluss  Weltstadt
0  Nürnberg     500000  Pegnitz       True
1   München    1000000     Isar       True
2  Erlangen     100000  Rednitz      False

In [5]:
del f['Fluss']; f

      Stadt  Einwohner  Weltstadt
0  Nürnberg     500000       True
1   München    1000000       True
2  Erlangen     100000      False

In [7]:
f.Stadt # bzw besser f['Stadt']

0    Nürnberg
1     München
2    Erlangen
Name: Stadt, dtype: object

In [8]:
f = DataFrame(data, columns=['Stadt', 'Fluss', 'Weltstadt'], index=['A','B','C'])
f

      Stadt    Fluss Weltstadt
A  Nürnberg  Pegnitz       NaN
B   München     Isar       NaN
C  Erlangen  Rednitz       NaN

In [9]:
f['Weltstadt'] = ( f['Stadt'] == 'München' ); f

      Stadt    Fluss  Weltstadt
A  Nürnberg  Pegnitz      False
B   München     Isar       True
C  Erlangen  Rednitz      False